## PAIR PROGRAMMING PANDAS V
---

En este ejercicio pondremos en práctica los conceptos básicos para juntar varios csv que compartan información.

Trabajaremos con tres ficheros diferentes:

- El csv que creamos en el ejercicio de pair programming Pandas IV, dónde recordamos eliminamos ciertas columnas que no eran necesarias, y habíamos creado nuevas.
- El csv llamado attacks_historico donde tenemos información sobre los ataques de tiburón previos al año 1800, este fichero lo tenéis un poco mas abajo para descargar.
- El csv llamado attacks_adicional donde tenemos información sobre los ataques de tiburón. de nuevo, este fichero lo tenéis abajo para descargar.

El principal objetivo de este ejercicio de pair programming es acabar teniendo un único DataFrame con toda la información contenida en los tres csv anteriores.

In [13]:
# Importamos las librerias

import pandas as pd
import numpy as np

Para llevar a cabo nuestro objetivo tendréis que seguir los siguientes pasos:



**EJERCICIO 1**

Cargad los tres ficheros nombrados anteriormente y los exploramos para familizarizarnos con ellos y saber que información tienen en común y debatir con tu compañera como podríamos juntar toda la información.

In [14]:
# Cargamos, abrimos y exploramos el archivo guardado del pair de ayer

df_attacks3 = pd.read_csv('attacks3.csv')
df_attacks3.head(3)

,Unnamed: 0,case_number,unnamed:_0,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo
0,0,2018.06.25,0,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI
1,6,2018.06.03.a,6,2018.0,Unprovoked,BRAZIL,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,M,18,Late afternoon,Tiger shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI
2,8,2018.05.26.b,8,2018.0,Unprovoked,USA,Florida,"Cocoa Beach, Brevard County",Walking,Cody High,M,15,17h00,"Bull shark, 6'",http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI

In [15]:
df_attacks3.shape

(1502, 16)

In [16]:
df_attacks3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1502 entries, 0 to 1501
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   1502 non-null   int64
 1   case_number  1502 non-null   object
 2   unnamed:_0   1502 non-null   int64
 3   year         1502 non-null   float64
 4   type         1502 non-null   object
 5   country      1502 non-null   object
 6   area         1502 non-null   object
 7   location     1502 non-null   object
 8   activity     1502 non-null   object
 9   name         1502 non-null   object
 10  sex_         1502 non-null   object
 11  age          1502 non-null   object
 12  time         1502 non-null   object
 13  species_     1502 non-null   object
 14  href         1502 non-null   object
 15  siglo        1502 non-null   object
dtypes: float64(1), int64(2), object(13)
memory usage: 187.9+ KB

In [17]:
# Cargamos, abrimos y exploramos el archivo 'attacks_historico'

df_historicos = pd.read_csv('attacks_historico.csv')
df_historicos.head(3)

,Unnamed: 0,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,...,NaN,V. C. Harvey-Brain,1800.00.00-Corsair-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1800.00.00,1800.00.00,171.0,NaN,NaN
1,6133,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,...,NaN,The Observer 5/28/1797,1797.05.28.R-Cloverdale.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1797.05.28.R,1797.05.28.R,170.0,NaN,NaN
2,6134,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,M,...,NaN,"The Waterford Herald, 9/15/1792",1792.09.12-Thames.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1792.09.12,1792.09.12,169.0,NaN,NaN

In [18]:
df_historicos.shape

(170, 22)

In [19]:
df_historicos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 170 entries, 0 to 169
Data columns (total 22 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Unnamed: 0              170 non-null    int64
 1   Case Number             170 non-null    object
 2   Year                    170 non-null    float64
 3   Type                    170 non-null    object
 4   Country                 160 non-null    object
 5   Area                    124 non-null    object
 6   Location                119 non-null    object
 7   Activity                139 non-null    object
 8   Name                    161 non-null    object
 9   Sex                     156 non-null    object
 10  Age                     16 non-null     object
 11  Time                    10 non-null     object
 12  Species                 44 non-null     object
 13  Investigator or Source  169 non-null    object
 14  pdf                     170 non-null    object
 15  href formula            170 non-null    object
 16  href                    170 non-null    object
 17  Case Number.1           170 non-null    object
 18  Case Number.2           170 non-null    object
 19  original order          170 non-null    float64
 20  Unnamed: 22             0 non-null      float64
 21  Unnamed: 23             0 non-null      float64
dtypes: float64(4), int64(1), object(17)
memory usage: 29.3+ KB

In [20]:
# Cargamos, abrimos y exploramos el archivo 'attacks_adicional'
df_adicional = pd.read_csv('attacks_adicional.csv')
df_adicional.head(3)

,Unnamed: 0,Case Number,Fatal (Y/N),Injury,Date
0,0,2018.06.25,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,1,2018.06.18,N,Minor injury to left thigh,18-Jun-2018
2,2,2018.06.09,N,Injury to left lower leg from surfboard skeg,09-Jun-2018

In [21]:
df_adicional.shape

(6288, 5)

In [22]:
df_adicional.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6288 entries, 0 to 6287
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   6288 non-null   int64
 1   Case Number  6287 non-null   object
 2   Fatal (Y/N)  5751 non-null   object
 3   Injury       6258 non-null   object
 4   Date         6286 non-null   object
dtypes: int64(1), object(4)
memory usage: 245.8+ KB

---

**EJERCICIO 2**

Chequead que los nombres de las columnas ver si se llaman iguales entre dataframes . ¿Están todas en minúsculas? ¿Tienen espacios? En caso de que no sean todas iguales unificad el nombre de las columnas.

In [23]:
# Primer DF
df_attacks3.columns

Index(['Unnamed: 0', 'case_number', 'unnamed:_0', 'year', 'type', 'country',
       'area', 'location', 'activity', 'name', 'sex_', 'age', 'time',
       'species_', 'href', 'siglo'],
      dtype='object')

In [24]:
# Hacemos un dict comprehension para modificar todas las columnas del DF, utilizando .lower y .replace
# Igual en las celdas de más abajo para los otros dos dataframes

columnas_rename = {col :  col.lower().replace(' ', '_') for col in df_attacks3.columns}

In [25]:
df_attacks3.rename(columns = columnas_rename, inplace = True)

In [26]:
df_attacks3.columns

Index(['unnamed:_0', 'case_number', 'unnamed:_0', 'year', 'type', 'country',
       'area', 'location', 'activity', 'name', 'sex_', 'age', 'time',
       'species_', 'href', 'siglo'],
      dtype='object')

In [27]:
# Segundo DF
 
df_historicos.columns

Index(['Unnamed: 0', 'Case Number', 'Year', 'Type', 'Country', 'Area',
       'Location', 'Activity', 'Name', 'Sex ', 'Age', 'Time', 'Species ',
       'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [28]:
columnas_rename2 = {col :  col.lower().replace(' ', '_') for col in df_historicos.columns}

In [29]:
df_historicos.rename(columns = columnas_rename2, inplace = True)

In [30]:
df_historicos.columns

Index(['unnamed:_0', 'case_number', 'year', 'type', 'country', 'area',
       'location', 'activity', 'name', 'sex_', 'age', 'time', 'species_',
       'investigator_or_source', 'pdf', 'href_formula', 'href',
       'case_number.1', 'case_number.2', 'original_order', 'unnamed:_22',
       'unnamed:_23'],
      dtype='object')

In [31]:
# Tercer DF

df_adicional.columns

Index(['Unnamed: 0', 'Case Number', 'Fatal (Y/N)', 'Injury', 'Date'], dtype='object')

In [32]:
columnas_rename3 = {col :  col.lower().replace(' ', '_') for col in df_adicional.columns}

In [33]:
df_adicional.rename(columns = columnas_rename3, inplace = True)

In [34]:
df_adicional.columns

Index(['unnamed:_0', 'case_number', 'fatal_(y/n)', 'injury', 'date'], dtype='object')

---

**EJERCICIO 3**

En este momento nos habremos dado cuenta que el DataFrame que generamos en el pair programming Pandas IV es similar al DataFrame de los datos historicos. Si recordamos, eliminamos algunas columnas en la sesión III que no eran útiles, pero esas columnas están todavía en el histórico. Si no fuera por eso podríamos unir esos dataframes. Realizad los cambios que creais necesarios para que los dataframes sean iguales y luego juntadlos usando el mejor método.

In [39]:
df_attacks3.head(2)

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,siglo
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,siglo-XXI
1,2018.06.03.a,2018.0,Unprovoked,BRAZIL,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,M,18,Late afternoon,Tiger shark,siglo-XXI

In [37]:
# Borramos la columna 'unnamed:_0' con el método .drop

df_attacks3.drop(["unnamed:_0"], axis = 1, inplace = True)

In [35]:
# Borramos la columna 'siglo' con el método .drop

df_attacks3.drop(["href"], axis = 1, inplace = True)

In [38]:
df_attacks3.shape

(1502, 13)

In [40]:
df_attacks3.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex_', 'age', 'time', 'species_', 'siglo'],
      dtype='object')

In [41]:
df_historicos.shape

(170, 22)

In [42]:
# Borramos varias columnas a la vez con el método .drop. Las necesarias para poder unir los dataframes
# con el método .concat

df_historicos.drop(["unnamed:_0","unnamed:_22", "unnamed:_23", "case_number.1", "case_number.2", "href_formula", "original_order", 
                        "investigator_or_source", "pdf",], axis = 1, inplace = True)

In [43]:
df_historicos.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex_', 'age', 'time', 'species_', 'href'],
      dtype='object')

In [44]:
df_historicos.head(2)

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...

In [45]:
# Realizamos la unión de los dataframes con el método .concat

df_unidos= pd.concat([df_historicos, df_attacks3], axis = 0, ignore_index= False)

In [46]:
df_unidos.head(2)

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN

In [47]:
df_unidos.tail(2)

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo
1500,1880.11.25,1880.0,Unprovoked,AUSTRALIA,Queensland,"Petrie Bight, Brisbane River",Swimming,Alexey Drury,M,12,Afternoon,Bull shark,NaN,siglo-XX
1501,1868.05.13,1868.0,Unprovoked,INDIA,Hoogly River,Ghat,Standing,male,M,35,Before 10h30,Identified as C. gangeticus by Dr. J. Fayrer,NaN,siglo-XX

In [48]:
df_unidos.shape

(1672, 14)

---

**EJERCICIO 4**

Es el momento de unir la información de todos los ataques de tiburón que acabamos de crear con el DataFrame de información adicional. Debatid que método es el más correcto para unir toda esta información y ejecutadlo.
📌 NOTA Cuando hagáis la unión considerad que la información que más nos interesa es la del DataFrame que creamos en el apartado anterior, lo cual determinará el tipo de unión.

In [49]:
df_adicional.head(2)

,unnamed:_0,case_number,fatal_(y/n),injury,date
0,0,2018.06.25,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,1,2018.06.18,N,Minor injury to left thigh,18-Jun-2018

In [50]:
df_adicional.shape

(6288, 5)

In [51]:
df_adicional.columns

Index(['unnamed:_0', 'case_number', 'fatal_(y/n)', 'injury', 'date'], dtype='object')

In [52]:
df_adicional.drop('unnamed:_0', axis=1, inplace=True)

In [53]:
df_adicional.columns

Index(['case_number', 'fatal_(y/n)', 'injury', 'date'], dtype='object')

In [54]:
df_unidos.head(2)

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN

In [55]:
# Fijamos un índice para poder unir con el método .join

df_adicional.set_index('case_number', inplace =True)

In [56]:
df_adicional.head(2)

,fatal_(y/n),injury,date
case_number,,,
2018.06.25,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
2018.06.18,N,Minor injury to left thigh,18-Jun-2018

In [57]:
# Realizamos la unión de los dataframes con el método .join

df_final= df_unidos.join(df_adicional, on = 'case_number', lsuffix = 'historicos', rsuffix= 'adicional')
df_final.head()

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo,fatal_(y/n),injury,date
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,Y,"FATAL, all onboard were killed by sharks",1800
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,Y,FATAL,Reported May-28-1797
2,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,M,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,Y,"FATAL, PROVOKED INCIDENT",12-Sep-1792
3,1791.00.00,1791.0,Unprovoked,AUSTRALIA,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,Y,"FATAL, ""bitten in two""",1791
4,1788.05.10,1788.0,Boat,AUSTRALIA,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,N,"No injury to occupants, shark bit oar and rudder",10-May-1788

In [ ]:
#list(df_final['case_number'].unique()) para comprobar los case_number

---

**EJERCICIO 5**

Guardad el dataframe nuevo en un csv que usaremos mañana en la clase de pair programming

In [58]:
# Guardamos el archivo en la carpeta del pair de hoy

df_final.to_csv('attacks5.csv')

In [59]:
# Guardamos el archivo en la carpeta del pair de mañana

df_final.to_csv('../pandas_VI/attacks5.csv')